TexasInstruments/ind-comms-sdk/examples/industrial_comms/profinet_device_demo/rt_mii/am243x-evm/r5fss0-0_freertos/example.syscfg
mpu_armv75.$name      = "CONFIG_MPU_REGION4_DDR";
mpu_armv75.baseAddr   = 0x80000000;
mpu_armv75.size       = 31;
mpu_armv75.attributes = "NonCached";

mpu_armv76.$name    = "CONFIG_MPU_REGION5_DDR_ICSS";
mpu_armv76.baseAddr = 0x80000000;
mpu_armv76.size     = 21;

mpu_armv77.$name      = "CONFIG_MPU_REGION6_DDR_DATA";
mpu_armv77.baseAddr   = 0x80200000;
mpu_armv77.size       = 20;
mpu_armv77.attributes = "NonCached";

mpu_armv78.$name      = "CONFIG_MPU_REGION7_DDR_BSS";
mpu_armv78.baseAddr   = 0x80300000;
mpu_armv78.size       = 20;
mpu_armv78.attributes = "NonCached";

mpu_armv79.$name      = "CONFIG_MPU_REGION8_DDR_PNIP";
mpu_armv79.baseAddr   = 0x80400000;
mpu_armv79.size       = 21;
mpu_armv79.attributes = "NonCached";

mpu_armv710.$name      = "CONFIG_MPU_REGION9_DDR_PERIF";
mpu_armv710.baseAddr   = 0x80600000;
mpu_armv710.size       = 21;
mpu_armv710.attributes = "NonCached";

mpu_armv711.$name      = "CONFIG_MPU_REGION3_DDR_RXTX";
mpu_armv711.baseAddr   = 0x80800000;
mpu_armv711.size       = 21;
mpu_armv711.attributes = "NonCached";

mpu_armv712.$name    = "CONFIG_MPU_REGION3_DDR_HEAP";
mpu_armv712.baseAddr = 0x80C00000;
mpu_armv712.size     = 21;

mpu_armv713.$name      = "CONFIG_MPU_REGION3";
mpu_armv713.baseAddr   = 0x70000000;
mpu_armv713.size       = 16;
mpu_armv713.attributes = "Cached+Sharable";

mpu_armv714.$name        = "CONFIG_MPU_PRU_ICSS";
mpu_armv714.baseAddr     = 0x30080000;
mpu_armv714.size         = 19;
mpu_armv714.attributes   = "Device";
mpu_armv714.allowExecute = false;

timer1.$name         = "CONFIG_TIMER0";
timer1.startTimer    = true;
timer1.timerCallback = "OSAL_FREERTOS_callbackTimer";
timer1.TIMER.$assign = "DMTIMER0";

timer2.$name         = "CONFIG_TIMER1";
timer2.usecPerTick   = 125;
timer2.timerCallback = "PND_EDDP_IrqSendClock";
timer2.TIMER.$assign = "DMTIMER1";

general1.$name           = "CONFIG_GENERAL0";
general1.stack_size      = 4096;
general1.heap_size       = 524288;
general1.additional_data = "\nLINKER_CMD_VAL_START_OF_DATA_MEM = START(DATA_MEM);\nLINKER_CMD_VAL_END_OF_DATA_MEM =   END(DATA_MEM);\nLINKER_CMD_VAL_START_OF_HEAP_MEM = START(HEAP_MEM);\nLINKER_CMD_VAL_END_OF_HEAP_MEM =   END(HEAP_MEM);";
general1.linker.$name    = "TIARMCLANG0";

region1.$name                                = "MEMORY_REGION_CONFIGURATION0";
region1.memory_region.create(12);
region1.memory_region[0].type                = "TCMA_R5F";
region1.memory_region[0].$name               = "R5F_VECS";
region1.memory_region[0].size                = 0x40;
region1.memory_region[0].auto                = false;
region1.memory_region[1].type                = "TCMA_R5F";
region1.memory_region[1].size                = 0x7FC0;
region1.memory_region[1].auto                = false;
region1.memory_region[1].manualStartAddress  = 0x40;
region1.memory_region[1].$name               = "R5F_TCMA";
region1.memory_region[2].type                = "TCMB_R5F";
region1.memory_region[2].$name               = "R5F_TCMB0";
region1.memory_region[2].size                = 0x8000;
region1.memory_region[2].auto                = false;
region1.memory_region[3].size                = 0x10000;
region1.memory_region[3].$name               = "ICSS_PKT_BUF_MEM";
region1.memory_region[3].auto                = false;
region1.memory_region[4].$name               = "HEAP_MEM";
region1.memory_region[4].size                = 0x80000;
region1.memory_region[4].auto                = false;
region1.memory_region[4].manualStartAddress  = 0x70010000;
region1.memory_region[5].auto                = false;
region1.memory_region[5].manualStartAddress  = 0x70090000;
region1.memory_region[5].size                = 0x144000;
region1.memory_region[5].$name               = "MSRAM";
region1.memory_region[6].$name               = "USER_SHM_MEM";
region1.memory_region[6].size                = 0x4000;
region1.memory_region[6].auto                = false;
region1.memory_region[6].manualStartAddress  = 0x701D4000;
region1.memory_region[7].auto                = false;
region1.memory_region[7].manualStartAddress  = 0x701D8000;
region1.memory_region[7].size                = 0x4000;
region1.memory_region[7].$name               = "LOG_SHM_MEM";
region1.memory_region[8].auto                = false;
region1.memory_region[8].size                = 0x4000;
region1.memory_region[8].$name               = "RTOS_NORTOS_IPC_SHM_MEM";
region1.memory_region[8].manualStartAddress  = 0x701DC000;
region1.memory_region[9].type                = "DDR_ALL";
region1.memory_region[9].$name               = "CODE_MEM";
region1.memory_region[9].size                = 0x1D0000;
region1.memory_region[9].auto                = false;
region1.memory_region[10].type               = "DDR_ALL";
region1.memory_region[10].$name              = "BOOT_PKT_MEM";
region1.memory_region[10].auto               = false;
region1.memory_region[10].manualStartAddress = 0x80200000;
region1.memory_region[10].size               = 0x200000;
region1.memory_region[11].type               = "DDR_ALL";
region1.memory_region[11].$name              = "DATA_MEM";
region1.memory_region[11].auto               = false;
region1.memory_region[11].manualStartAddress = 0x80400000;
region1.memory_region[11].size               = 0x200000;

section1.$name                        = "CONFIG_SECTION0";
section1.load_memory                  = "R5F_VECS";
section1.group                        = false;
section1.output_section.create(1);
section1.output_section[0].$name      = ".vectors";
section1.output_section[0].palignment = true;

section2.$name                        = "CONFIG_SECTION1";
section2.group                        = false;
section2.load_memory                  = "R5F_TCMA";
section2.output_section.create(2);
section2.output_section[0].$name      = ".text.hwi";
section2.output_section[0].palignment = true;
section2.output_section[1].$name      = ".text_tcm";
section2.output_section[1].palignment = true;

section3.$name                        = "CONFIG_SECTION2";
section3.load_memory                  = "MSRAM";
section3.output_section.create(3);
section3.output_section[0].$name      = ".ARM.exidx";
section3.output_section[0].palignment = true;
section3.output_section[1].$name      = ".init_array";
section3.output_section[1].palignment = true;
section3.output_section[2].$name      = ".fini_array";
section3.output_section[2].palignment = true;

section4.$name                        = "CONFIG_SECTION3";
section4.load_memory                  = "MSRAM";
section4.output_section.create(3);
section4.output_section[0].$name      = ".text.cache";
section4.output_section[0].palignment = true;
section4.output_section[1].$name      = ".text.mpu";
section4.output_section[1].palignment = true;
section4.output_section[2].$name      = ".text.boot";
section4.output_section[2].palignment = true;

section5.$name                        = "CONFIG_SECTION4";
section5.load_memory                  = "CODE_MEM";
section5.output_section.create(2);
section5.output_section[0].palignment = true;
section5.output_section[0].$name      = ".text";
section5.output_section[1].palignment = true;
section5.output_section[1].$name      = ".rodata";

section6.$name                        = "CONFIG_SECTION5";
section6.load_memory                  = "MSRAM";
section6.output_section.create(3);
section6.output_section[0].$name      = ".data";
section6.output_section[0].palignment = true;
section6.output_section[1].$name      = ".threadstack";
section6.output_section[1].palignment = true;
section6.output_section[2].$name      = ".stack";
section6.output_section[2].palignment = true;

