TexasInstruments/ind-comms-sdk/examples/industrial_comms/profinet_device_demo/rt_mii/am243x-evm/r5fss0-0_freertos/example.syscfg
section7.$name                                   = "CONFIG_SECTION6";
section7.load_memory                             = "DATA_MEM";
section7.output_section.create(1);
section7.output_section[0].$name                 = ".bss";
section7.output_section[0].palignment            = true;
section7.output_section[0].output_sections_start = "__BSS_START";
section7.output_section[0].output_sections_end   = "__BSS_END";

section8.$name                                    = "CONFIG_SECTION7";
section8.load_memory                              = "MSRAM";
section8.output_section.create(5);
section8.output_section[0].$name                  = ".irqstack";
section8.output_section[0].output_sections_start  = "__IRQ_STACK_START";
section8.output_section[0].output_sections_end    = "__IRQ_STACK_END";
section8.output_section[0].macro_name             = "IRQSTACK_SECTION";
section8.output_section[0].input_section.create(1);
section8.output_section[0].input_section[0].$name = ". = . + __IRQ_STACK_SIZE;";
section8.output_section[1].$name                  = ".fiqstack";
section8.output_section[1].output_sections_start  = "__FIQ_STACK_START";
section8.output_section[1].output_sections_end    = "__FIQ_STACK_END";
section8.output_section[1].input_section.create(1);
section8.output_section[1].input_section[0].$name = ". = . + __FIQ_STACK_SIZE;";
section8.output_section[2].$name                  = ".svcstack";
section8.output_section[2].output_sections_start  = "__SVC_STACK_START";
section8.output_section[2].output_sections_end    = "__SVC_STACK_END";
section8.output_section[2].input_section.create(1);
section8.output_section[2].input_section[0].$name = ". = . + __SVC_STACK_SIZE;";
section8.output_section[3].$name                  = ".abortstack";
section8.output_section[3].output_sections_start  = "__ABORT_STACK_START";
section8.output_section[3].output_sections_end    = "__ABORT_STACK_END";
section8.output_section[3].input_section.create(1);
section8.output_section[3].input_section[0].$name = ". = . + __ABORT_STACK_SIZE;";
section8.output_section[4].$name                  = ".undefinedstack";
section8.output_section[4].output_sections_start  = "__UNDEFINED_STACK_START";
section8.output_section[4].output_sections_end    = "__UNDEFINED_STACK_END";
section8.output_section[4].input_section.create(1);
section8.output_section[4].input_section[0].$name = ". = . + __UNDEFINED_STACK_SIZE;";

section9.$name                       = "CONFIG_SECTION8";
section9.type                        = "NOLOAD";
section9.group                       = false;
section9.load_memory                 = "ICSS_PKT_BUF_MEM";
section9.output_section.create(1);
section9.output_section[0].$name     = ".bss.icss_emac_pktbuf_mem";
section9.output_section[0].alignment = 0;

section10.$name                       = "CONFIG_SECTION9";
section10.group                       = false;
section10.type                        = "NOLOAD";
section10.load_memory                 = "USER_SHM_MEM";
section10.output_section.create(1);
section10.output_section[0].$name     = ".bss.user_shared_mem";
section10.output_section[0].alignment = 0;

section11.$name                       = "CONFIG_SECTION10";
section11.type                        = "NOLOAD";
section11.load_memory                 = "LOG_SHM_MEM";
section11.group                       = false;
section11.output_section.create(1);
section11.output_section[0].$name     = ".bss.log_shared_mem";
section11.output_section[0].alignment = 0;

section12.$name                       = "CONFIG_SECTION11";
section12.group                       = false;
section12.load_memory                 = "RTOS_NORTOS_IPC_SHM_MEM";
section12.output_section.create(1);
section12.output_section[0].$name     = ".bss.ipc_vring_mem";
section12.output_section[0].alignment = 0;

section13.$name                       = "CONFIG_SECTION12";
section13.group                       = false;
section13.load_memory                 = "HEAP_MEM";
section13.output_section.create(1);
section13.output_section[0].$name     = ".sysmem";
section13.output_section[0].alignment = 0;

section14.$name                       = "CONFIG_SECTION13";
section14.type                        = "NOLOAD";
section14.group                       = false;
section14.load_memory                 = "BOOT_PKT_MEM";
section14.output_section.create(1);
section14.output_section[0].$name     = ".boot_pkt_mem";
section14.output_section[0].alignment = 0;

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
flash1.peripheralDriver.OSPI.CLK.$suggestSolution          = "OSPI0_CLK";
flash1.peripheralDriver.OSPI.CSn0.$suggestSolution         = "OSPI0_CSn0";
flash1.peripheralDriver.OSPI.DQS.$suggestSolution          = "OSPI0_DQS";
flash1.peripheralDriver.OSPI.D7.$suggestSolution           = "OSPI0_D7";
flash1.peripheralDriver.OSPI.D6.$suggestSolution           = "OSPI0_D6";
flash1.peripheralDriver.OSPI.D5.$suggestSolution           = "OSPI0_D5";
flash1.peripheralDriver.OSPI.D4.$suggestSolution           = "OSPI0_D4";
flash1.peripheralDriver.OSPI.D3.$suggestSolution           = "OSPI0_D3";
flash1.peripheralDriver.OSPI.D2.$suggestSolution           = "OSPI0_D2";
flash1.peripheralDriver.OSPI.D1.$suggestSolution           = "OSPI0_D1";
flash1.peripheralDriver.OSPI.D0.$suggestSolution           = "OSPI0_D0";
i2c1.I2C.SCL.$suggestSolution                              = "I2C1_SCL";
i2c1.I2C.SDA.$suggestSolution                              = "I2C1_SDA";
i2c2.I2C.SCL.$suggestSolution                              = "I2C0_SCL";
i2c2.I2C.SDA.$suggestSolution                              = "I2C0_SDA";
profinet1.PRU_ICSSG1_MDIO.$suggestSolution                 = "PRU_ICSSG1_MDIO0";
profinet1.PRU_ICSSG1_MDIO.MDC.$suggestSolution             = "PRG1_MDIO0_MDC";
profinet1.PRU_ICSSG1_MDIO.MDIO.$suggestSolution            = "PRG1_MDIO0_MDIO";
profinet1.PRU_ICSSG1_MII_G_RT.$suggestSolution             = "PRU_ICSSG1_MII_G_RT";
profinet1.PRU_ICSSG1_MII_G_RT.MII0_RXD0.$suggestSolution   = "PRG1_PRU0_GPO0";
profinet1.PRU_ICSSG1_MII_G_RT.MII0_RXD1.$suggestSolution   = "PRG1_PRU0_GPO1";
profinet1.PRU_ICSSG1_MII_G_RT.MII0_RXD2.$suggestSolution   = "PRG1_PRU0_GPO2";
profinet1.PRU_ICSSG1_MII_G_RT.MII0_RXD3.$suggestSolution   = "PRG1_PRU0_GPO3";
profinet1.PRU_ICSSG1_MII_G_RT.MII0_RXDV.$suggestSolution   = "PRG1_PRU0_GPO4";
profinet1.PRU_ICSSG1_MII_G_RT.MII0_RXER.$suggestSolution   = "PRG1_PRU0_GPO5";
profinet1.PRU_ICSSG1_MII_G_RT.MII0_TXD0.$suggestSolution   = "PRG1_PRU0_GPO11";
profinet1.PRU_ICSSG1_MII_G_RT.MII0_TXD1.$suggestSolution   = "PRG1_PRU0_GPO12";
profinet1.PRU_ICSSG1_MII_G_RT.MII0_TXD2.$suggestSolution   = "PRG1_PRU0_GPO13";
profinet1.PRU_ICSSG1_MII_G_RT.MII0_TXD3.$suggestSolution   = "PRG1_PRU0_GPO14";
profinet1.PRU_ICSSG1_MII_G_RT.MII0_TXEN.$suggestSolution   = "PRG1_PRU0_GPO15";
profinet1.PRU_ICSSG1_MII_G_RT.MII1_RXD0.$suggestSolution   = "PRG1_PRU1_GPO0";
profinet1.PRU_ICSSG1_MII_G_RT.MII1_RXD1.$suggestSolution   = "PRG1_PRU1_GPO1";
profinet1.PRU_ICSSG1_MII_G_RT.MII1_RXD2.$suggestSolution   = "PRG1_PRU1_GPO2";
profinet1.PRU_ICSSG1_MII_G_RT.MII1_RXD3.$suggestSolution   = "PRG1_PRU1_GPO3";
profinet1.PRU_ICSSG1_MII_G_RT.MII1_RXDV.$suggestSolution   = "PRG1_PRU1_GPO4";
profinet1.PRU_ICSSG1_MII_G_RT.MII1_RXER.$suggestSolution   = "PRG1_PRU1_GPO5";
profinet1.PRU_ICSSG1_MII_G_RT.MII1_TXD0.$suggestSolution   = "PRG1_PRU1_GPO11";
profinet1.PRU_ICSSG1_MII_G_RT.MII1_TXD1.$suggestSolution   = "PRG1_PRU1_GPO12";
profinet1.PRU_ICSSG1_MII_G_RT.MII1_TXD2.$suggestSolution   = "PRG1_PRU1_GPO13";
profinet1.PRU_ICSSG1_MII_G_RT.MII1_TXD3.$suggestSolution   = "PRG1_PRU1_GPO14";
profinet1.PRU_ICSSG1_MII_G_RT.MII1_TXEN.$suggestSolution   = "PRG1_PRU1_GPO15";
profinet1.PRU_ICSSG1_MII_G_RT.MII_MR0_CLK.$suggestSolution = "PRG1_PRU0_GPO6";
profinet1.PRU_ICSSG1_MII_G_RT.MII_MR1_CLK.$suggestSolution = "PRG1_PRU1_GPO6";
profinet1.PRU_ICSSG1_MII_G_RT.MII_MT0_CLK.$suggestSolution = "PRG1_PRU0_GPO16";
profinet1.PRU_ICSSG1_MII_G_RT.MII_MT1_CLK.$suggestSolution = "PRG1_PRU1_GPO16";
profinet1.PRU_ICSSG1_MII_G_RT.MII0_RXLINK.$suggestSolution = "PRG1_PRU0_GPO8";
profinet1.PRU_ICSSG1_MII_G_RT.MII1_RXLINK.$suggestSolution = "PRG1_PRU1_GPO8";
debug_log.uartLog.UART.RXD.$suggestSolution                = "UART0_RXD";
debug_log.uartLog.UART.TXD.$suggestSolution                = "UART0_TXD";
